DATA = {
    "Локация": {
        "Ядерная война": {
            'Описание': 'Прошла ядерная война, везде радиация, пыль окутала планету и не видно солнечного света, началась ядерная зима. После выхода из бункера проблемы с почвой и водой, на земле суммарно осталось около 2млн человек',
            'Профессии': ['Иммунолог', 'Агроном']
        }, "Нашествие демонов": {
            'Описание': 'Темнота, демоны оружием не убиваются',
            'Профессии': ['Священник', 'Экзорцист']
        }, "Эпидемия": {
            'Описание': 'Заражена почва, Мутации организмов',
            'Профессии': ['Вирусолог', 'Геолог']
        },
        'Восстание растений':{
            'Описание': '',
        }
    }, "Бункер": [    #2 рандомные вещи
        'Библиотека', 'Компьютер', 'Теплица', 'Пособие для изучения ин языков',
        'Баскетбольный корт',
        'тату студия',
        'кинотеатр',
        'Акушерский кабинет',
        'Выставка современного исскусства',
        'Прачечная',
        'Оружие без патронов',
        'Оружие с патронами',
        'Лгбт флаг',
        'Вонючий туалет',
        'Нет туалета',
        'Крысы',
    ], "Профессия": [
        'Безработный',
        'Иммунолог', 'Вирусолог', 'Эколог',
        'Хирург', 'Стоматолог', 'Медсестра', 'Уролог', 'Гинеколог', 'Проктолог', 'Психолог', 'Сэксолог'
        'Священник', 'Экзорцист', 
        'Агроном', 'Геолог', 'Геодезист', 'Археолог', 'Эколог', 'Садовник', 
        'Адвокат', 'Юрист', 'Бухгалтер', 'Маркетолог', 'Судья', 
        'Бармен', 'Оффициант', 'Стюардесса', 'Педагог', 'Продавец', 'Клоун', 'Фотограф', 'Охотник', 'Дровосек', 'Гонщик', 'Повар', 'Заводчик шпецов', 'Скупщик автомобилей', 'Пивовар',
        'Программист', 'Инженер-электрик', 'Инженер-строитель', 'Инженер-телекоммуникаций', 'Водитель-таксист', 'Водитель-дальнобойщик',
        'Ученый', 'Шахтер', 'Сварщик', 'Ювелир', 'Кузнец',
        'Спасатель', 'Военный', 'Полицейский', 'Пожарный', 'Охранник', 'Сталевар',
        'Протестующий афроамериканец',
    ], "Багаж": [
        'Компьютер', 'Молоток', 'Набор для пивоварения', 'Нинтендо свитч', 'Калик', 'Наручники для БДСМ',
        'Черный ребенок',
        'Конфеты из Гарри-Поттера со вкусом ушной серы',
        'Матрешка Тотторо',
        'Противогаз',
        'Пестициды',
        'Набор для маникюра',
        'Кегли',
        'Пакет с пакетами',
        'Смарт часы',
        'Промокод Яндекс еды',
        'Книга разумный инвестор Уоррена Баффета',
        'Скейтборд',
        'Шприц с адреналином',
        'Нурофен',
        'Лекарство от шизы на пол года',
        '100 баксов',
        'Резинка для волос',
        'Гандон',
        'Бита',
        'Секатор',
        'Консервы на неделю',
        'Машинка для татуировки',
        'Ручная крыса',
        'Линекс',
    ], "Состояние здоровья": [      #Выбирается степень тяжести
        'Идеально здоров',
        'Идеально здоров',
        'Идеально здоров',
        'Идеально здоров',
        'Идеально здоров', 'Рак легких', 'Рак желудка', 'Косоглазие', 'Астма', 'Шизофрения', 'Алкоголик', 'Безрукий', 'Безногий', 
        'Синдром слабого желудка',
        'Диарея',
        'Булемия',
        'Анорексия',
        'Несветываемость крови',
        'Мигрень',
        'Щелкающая нога',
        'Непереносимость сильных запахов',
        'ухудшение памяти',

    ],  
    "Биологическая характеристика": ['Женщина', 'Мужчина'],  #Дл якаждой на рандоме выбирается бесплоден ли, сколько лет    -   параметры рост вес
    'Хобби': [
        'Скейтборбинг', 'Игра на пианино', 'Рыбалка', 'Изучал составы различных жидкостей', 'Гребля на каное', 'Футболист',
        'Художественная гимнастика',
        'космонавт',
        'ветеринар',
        'Наблюдение за птицами',
        ],    #Выбирается стаж
    'Человеческое качество': ['Замкнутый', 'Упорный', 'Ленивый', 'Нимфоман', 'Плаксивый', 'Безкомпромисный',
        'Феминизм',
        'Тупой',
        'Гений',
        'Пунктуальный',
        'Непунктуальный',
        'Терпеливый',
        'Нетерпеливый',
        'Злой',
        'Добрый',
        'Воняет',
        'Трансгендер',
        'Гей',
        'Транснигер',
        'Нигер',
        'Стукач',
        'Милосердный',
        'Задрот',
        'Фанатик',
        'Дрочила',
        'Ботан',
        'Гопник',
        'Великодушный',
    ],    #Выбирается выраженность
    'Фобия': ['нет', 'Боязнь темноты', 'Боязнь света', 'Боязнь клоунов', 'Боязнь священников', 'Страх выступлений на публику',
        'Боязнь Книг',
        'Боязнь Техники',
        'Боязнь мужчин',
        'Боязнь женщин',
        'Боязнь чернокожих',
        'Ненависть к лгбт',

    ],
    'Дополнительный навык': [
        'Уролог', 'Гинеколог', 'Занимался боевыми исскусствами', 'В детстве занимался в музыкалке'
        'Знаю серьезных дадек',
    ], 'Карточки': [
        'Изменить профессию у себя', 'Изменить профессию у выбранного человека', 'Изменить профессию у всех',
        'Поменяться здоровьем c другим человеком', 'Заменить всем здоровье', 'Вылечить другого игрока', 'Вылечить себя',
        'Заменить всем Биологическую характеристику', 'Заменить биологическую характеристику себе', 'Заменить биологическую характеристику выбранному игроку', 
        'Заменить всем параметры', 'Заменить параметры себе', 'Заменить параметры другому человеку',
        'Возможность кинуть 2 голоса',
    ],   #Для каждого выбирается 2 карты
}


# первый круг - профессия и 2 харки на выбор = 3 характеристики
# когда вскрываете пол, вскрываете и возраст и стаж
# если сильное ожирение - не может иметь потомство
# нельзя понтануться картой - если говоришь собержание -> юзаешь её
"""
ухудшение памяти
ветеринар
в бункере крысы
наблюдение за птицами
окушер гинеколог
библиотекарь
великодушный
Знаю серьезных дядек
космонавт

"""

# первый круг --> голосование за выкид

# добавить братские узы
# добавить врагов
# поднимаем пальцы, сколько в тебя проголосовало
# после раскидывания голосов, можно перенести голос